{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[STOP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SPACE]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[STOP]": 0,
      "[UNK]": 1,
      "[SPACE]": 2,
      "!": 3,
      "'": 4,
      ",": 5,
      "-": 6,
      ".": 7,
      "0": 8,
      "1": 9,
      "2": 10,
      "3": 11,
      "5": 12,
      "7": 13,
      "9": 14,
      "a": 15,
      "b": 16,
      "c": 17,
      "d": 18,
      "e": 19,
      "f": 20,
      "g": 21,
      "h": 22,
      "i": 23,
      "j": 24,
      "k": 25,
      "l": 26,
      "m": 27,
      "n": 28,
      "o": 29,
      "p": 30,
      "q": 31,
      "r": 32,
      "s": 33,
      "t": 34,
      "u": 35,
      "v": 36,
      "w": 37,
      "x": 38,
      "y": 39,
      "z": 40,
      "،": 41,
      "؛": 42,
      "؟": 43,
      "ء": 44,
      "آ": 45,
      "أ": 46,
      "ؤ": 47,
      "إ": 48,
      "ئ": 49,
      "ا": 50,
      "ب": 51,
      "ة": 52,
      "ت": 53,
      "ث": 54,
      "ج": 55,
      "ح": 56,
      "خ": 57,
      "د": 58,
      "ذ": 59,
      "ر": 60,
      "ز": 61,
      "س": 62,
      "ش": 63,
      "ص": 64,
      "ض": 65,
      "ط": 66,
      "ظ": 67,
      "ع": 68,
      "غ": 69,
      "ـ": 70,
      "ف": 71,
      "ق": 72,
      "ك": 73,
      "ل": 74,
      "م": 75,
      "ن": 76,
      "ه": 77,
      "و": 78,
      "ى": 79,
      "ي": 80,
      "ً": 81,
      "ٌ": 82,
      "ٍ": 83,
      "َ": 84,
      "ُ": 85,
      "ِ": 86,
      "ّ": 87,
      "ْ": 88,
      "ال": 89,
      "نا": 90,
      "ني": 91,
      "لي": 92,
      "ما": 93,
      "ها": 94,
      "لا": 95,
      "بي": 96,
      "ان": 97,
      "في": 98,
      "وا": 99,
      "من": 100,
      "يع": 101,
      "ول": 102,
      "نه": 103,
      "ير": 104,
      "اللي": 105,
      "ين": 106,
      "يعني": 107,
      "بت": 108,
      "عل": 109,
      "يا": 110,
      "له": 111,
      "بع": 112,
      "ذا": 113,
      "الم": 114,
      "كي": 115,
      "ار": 116,
      "دي": 117,
      "عم": 118,
      "بس": 119,
      "كل": 120,
      "مع": 121,
      "را": 122,
      "مش": 123,
      "أنا": 124,
      "أنه": 125,
      "هي": 126,
      "عن": 127,
      "رة": 128,
      "على": 129,
      "شو": 130,
      "شي": 131,
      "هذا": 132,
      "ون": 133,
      "دا": 134,
      "هم": 135,
      "انا": 136,
      "قول": 137,
      "الـ": 138,
      "انت": 139,
      "كت": 140,
      "كن": 141,
      "حكي": 142,
      "هاي": 143,
      "الله": 144,
      "ية": 145,
      "بد": 146,
      "رف": 147,
      "الأ": 148,
      "هو": 149,
      "ري": 150,
      "حت": 151,
      "بـ": 152,
      "طي": 153,
      "ست": 154,
      "ناس": 155,
      "طل": 156,
      "هل": 157,
      "وع": 158,
      "ور": 159,
      "ولا": 160,
      "بن": 161,
      "بال": 162,
      "وم": 163,
      "اي": 164,
      "بل": 165,
      "ات": 166,
      "حد": 167,
      "قد": 168,
      "اه": 169,
      "فل": 170,
      "هيك": 171,
      "إنه": 172,
      "لك": 173,
      "لت": 174,
      "الت": 175,
      "حنا": 176,
      "قا": 177,
      "كث": 178,
      "علي": 179,
      "كان": 180,
      "بح": 181,
      "بدي": 182,
      "طلع": 183,
      "كتير": 184,
      "فك": 185,
      "إشي": 186,
      "لما": 187,
      "لة": 188,
      "وق": 189,
      "الع": 190,
      "سا": 191,
      "يم": 192,
      "الح": 193,
      "عد": 194,
      "عش": 195,
      "كون": 196,
      "مي": 197,
      "فلس": 198,
      "عمل": 199,
      "عند": 200,
      "الش": 201,
      "رو": 202,
      "الي": 203,
      "صح": 204,
      "أن": 205,
      "إحنا": 206,
      "وج": 207,
      "مل": 208,
      "تع": 209,
      "الناس": 210,
      "واحد": 211,
      "فـ": 212,
      "يش": 213,
      "زي": 214,
      "وص": 215,
      "اني": 216,
      "سي": 217,
      "ًا": 218,
      "وت": 219,
      "خل": 220,
      "وي": 221,
      "بر": 222,
      "غير": 223,
      "قة": 224,
      "والله": 225,
      "زة": 226,
      "راح": 227,
      "شوف": 228,
      "إن": 229,
      "لل": 230,
      "رب": 231,
      "كيف": 232,
      "جي": 233,
      "لأنه": 234,
      "الك": 235,
      "لو": 236,
      "مت": 237,
      "بعد": 238,
      "فت": 239,
      "انه": 240,
      "صير": 241,
      "رت": 242,
      "اس": 243,
      "وض": 244,
      "كنت": 245,
      "جا": 246,
      "كثير": 247,
      "عشان": 248,
      "با": 249,
      "مث": 250,
      "مة": 251,
      "طين": 252,
      "عا": 253,
      "طيب": 254
    },
    "merges": [
      "ا ل",
      "ن ا",
      "ن ي",
      "ل ي",
      "م ا",
      "ه ا",
      "ل ا",
      "ب ي",
      "ا ن",
      "ف ي",
      "و ا",
      "م ن",
      "ي ع",
      "و ل",
      "ن ه",
      "ي ر",
      "ال لي",
      "ي ن",
      "يع ني",
      "ب ت",
      "ع ل",
      "ي ا",
      "ل ه",
      "ب ع",
      "ذ ا",
      "ال م",
      "ك ي",
      "ا ر",
      "د ي",
      "ع م",
      "ب س",
      "ك ل",
      "م ع",
      "ر ا",
      "م ش",
      "أ نا",
      "أ نه",
      "ه ي",
      "ع ن",
      "ر ة",
      "عل ى",
      "ش و",
      "ش ي",
      "ه ذا",
      "و ن",
      "د ا",
      "ه م",
      "ا نا",
      "ق ول",
      "ال ـ",
      "ان ت",
      "ك ت",
      "ك ن",
      "ح كي",
      "ها ي",
      "ال له",
      "ي ة",
      "ب د",
      "ر ف",
      "ال أ",
      "ه و",
      "ر ي",
      "ح ت",
      "ب ـ",
      "ط ي",
      "س ت",
      "نا س",
      "ط ل",
      "ه ل",
      "و ع",
      "و ر",
      "و لا",
      "ب ن",
      "ب ال",
      "و م",
      "ا ي",
      "ب ل",
      "ا ت",
      "ح د",
      "ق د",
      "ا ه",
      "ف ل",
      "هي ك",
      "إ نه",
      "ل ك",
      "ل ت",
      "ال ت",
      "ح نا",
      "ق ا",
      "ك ث",
      "ع لي",
      "ك ان",
      "ب ح",
      "ب دي",
      "طل ع",
      "كت ير",
      "ف ك",
      "إ شي",
      "ل ما",
      "ل ة",
      "و ق",
      "ال ع",
      "س ا",
      "ي م",
      "ال ح",
      "ع د",
      "ع ش",
      "ك ون",
      "م ي",
      "فل س",
      "عم ل",
      "عن د",
      "ال ش",
      "ر و",
      "ال ي",
      "ص ح",
      "أ ن",
      "إ حنا",
      "و ج",
      "م ل",
      "ت ع",
      "ال ناس",
      "وا حد",
      "ف ـ",
      "ي ش",
      "ز ي",
      "و ص",
      "ا ني",
      "س ي",
      "ً ا",
      "و ت",
      "خ ل",
      "و ي",
      "ب ر",
      "غ ير",
      "ق ة",
      "و الله",
      "ز ة",
      "را ح",
      "شو ف",
      "إ ن",
      "ل ل",
      "ر ب",
      "كي ف",
      "ج ي",
      "ل أنه",
      "ال ك",
      "ل و",
      "م ت",
      "بع د",
      "ف ت",
      "ان ه",
      "ص ير",
      "ر ت",
      "ا س",
      "و ض",
      "كن ت",
      "ج ا",
      "كث ير",
      "عش ان",
      "ب ا",
      "م ث",
      "م ة",
      "ط ين",
      "ع ا",
      "طي ب"
    ]
  }
}